import './models/category.dart';

import './models/trip.dart';

const Categories_data = const [
  Category(
    id: 'c1',
    title: 'جبال',
    imageUrl:
        'https://images.unsplash.com/photo-1575728252059-db43d03fc2de?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NTh8fG1vdW5hdGluc3xlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=',
  ),
  Category(
    id: 'c2',
    title: 'بحيرات',
    imageUrl:
        'https://images.unsplash.com/photo-1501785888041-af3ef285b470?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NHx8bGFrZXxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  Category(
    id: 'c3',
    title: 'شواطىء',
    imageUrl:
        'https://images.unsplash.com/photo-1493558103817-58b2924bce98?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTAxfHxiZWFjaHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  Category(
    id: 'c4',
    title: 'صحارى',
    imageUrl:
        'https://images.unsplash.com/photo-1473580044384-7ba9967e16a0?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8ZGVzZXJ0fGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  Category(
    id: 'c5',
    title: 'مدن تاريخية',
    imageUrl:
        'https://images.unsplash.com/photo-1467269204594-9661b134dd2b?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjR8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  Category(
    id: 'c6',
    title: 'أخرى',
    imageUrl:
        'https://images.unsplash.com/photo-1605540436563-5bca919ae766?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8c2tpaW5nfGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
];
const Trips_data = const [
  Trip(
    id: 'm1',
    categories: [
      'c1',
    ],
    title: 'جبال الألب',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1611523658822-385aa008324c?ixid=MXwxMjA3fDB8MHxzZWFyY2h8N3x8bW91bmF0aW5zfGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 20,
    activities: [
      'الاقامة في جو من المغامرات',
      'جولة سياحية على الأقدام',
      'تسلق الجبل و الوصول الي القمة',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'بمجرد وصولك إلى فندقك ، ستتمكن من تسجيل الوصول والاستمتاع بإقامتك هناك, يمكنك الاستمتاع بعشاءك في هذا الفندق'
          'سيأخذك مندوبنا من فندقك الساعة 02:00 صباحًا إلى جبل، ستبدأ في تسلق جبل القريب. بالطبع، سيرافقك دليلك إلى قمة الجبل. أيضًا، نقدم مرشدًا بدويًا أيضًا,أثناء صعودك إلى قمة الجبل ، ستتوقف مرتين أو أكثر,بمجرد وصولك إلى قمة جبل موسى، ستبدأ في الاستمتاع بمشاهدة شروق الشمس. سيكون ساحرا! في حالة وصولك إلى قمة الجبل مبكرًا قليلاً عن الفجر، يمكنك انتظاره خلال الفجر ، تشرق الشمس بشكل رائع أمام عينيك',
      'ستكون النقطة الأخيرة في هذه الرحلة هي تناول وجبة الإفطار في فندق',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm2',
    categories: [
      'c1',
    ],
    title: 'جبال الجنوب',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1612456225451-bb8d10d0131d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjZ8fG1vdW5hdGluc3xlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 10,
    activities: [
      'الاقامة في جو من المغامرات',
      'جولة سياحية على الأقدام',
      'تسلق الجبل و الوصول الي القمة',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'بمجرد وصولك إلى فندقك ، ستتمكن من تسجيل الوصول والاستمتاع بإقامتك هناك, يمكنك الاستمتاع بعشاءك في هذا الفندق'
          'سيأخذك مندوبنا من فندقك الساعة 02:00 صباحًا إلى جبل، ستبدأ في تسلق جبل القريب. بالطبع، سيرافقك دليلك إلى قمة الجبل. أيضًا، نقدم مرشدًا بدويًا أيضًا,أثناء صعودك إلى قمة الجبل ، ستتوقف مرتين أو أكثر,بمجرد وصولك إلى قمة جبل موسى، ستبدأ في الاستمتاع بمشاهدة شروق الشمس. سيكون ساحرا! في حالة وصولك إلى قمة الجبل مبكرًا قليلاً عن الفجر، يمكنك انتظاره خلال الفجر ، تشرق الشمس بشكل رائع أمام عينيك',
      'ستكون النقطة الأخيرة في هذه الرحلة هي تناول وجبة الإفطار في فندق',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm3',
    categories: [
      'c1',
    ],
    title: 'جبل سانت كاترين',
    tripType: TripType.Recovery,
    season: Season.Winter,
    imageUrl:
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRynwksIkX7tDiQzv4xOT9F-EkOyLAAmDVjiA&usqp=CAU',
    duration: 45,
    activities: [
      'الاقامة في جو من المغامرات',
      'جولة سياحية على الأقدام',
      'تسلق الجبل و الوصول الي القمة',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'بمجرد وصولك إلى فندقك ، ستتمكن من تسجيل الوصول والاستمتاع بإقامتك هناك, يمكنك الاستمتاع بعشاءك في هذا الفندق'
          'سيأخذك مندوبنا من فندقك الساعة 02:00 صباحًا إلى جبل، ستبدأ في تسلق جبل القريب. بالطبع، سيرافقك دليلك إلى قمة الجبل. أيضًا، نقدم مرشدًا بدويًا أيضًا,أثناء صعودك إلى قمة الجبل ، ستتوقف مرتين أو أكثر,بمجرد وصولك إلى قمة جبل موسى، ستبدأ في الاستمتاع بمشاهدة شروق الشمس. سيكون ساحرا! في حالة وصولك إلى قمة الجبل مبكرًا قليلاً عن الفجر، يمكنك انتظاره خلال الفجر ، تشرق الشمس بشكل رائع أمام عينيك',
      'ستكون النقطة الأخيرة في هذه الرحلة هي تناول وجبة الإفطار في فندق',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm4',
    categories: [
      'c2',
    ],
    title: 'بحيرة واحة سيوة',
    tripType: TripType.Activities,
    season: Season.Spring,
    imageUrl:
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS5LeuZflfGydcJRxIXN59jq9miSTt3KSAhYA&usqp=CAU',
    duration: 60,
    activities: [
      'الاستمتاع ببحيرات الملح',
      'سباحة في الابار وبحيرات الملح',
      'الاستمتاع بالجو البدوي ',
      'تناول وجبة الغداء والعشاء علي الطريقه البدوية',
      'استمتاع المناظر الجملية'
    ],
    program: [
      ' وصول سيوة فى الصباح الباكر , استلام الغرف ثم الافطار ,الاستعداد لمشاهدة معالم المدينة ,زيارة مدينة شالى القديمة ,زيارة جبل الدكرورى ,قضاء باقى اليوم فى كامب شهير و نزول المياة الكبريتية ,حفلة عشاء بدوى سيوى (ابو مردم )بط و لحم  ,  يمكنك استكشاف الصحراء ليلا في تجربة فريدة.',
      'مشاهدة طبيعة سيوة في مغامرة صباحا  ,الافطار مبكرا فى الفندق ,زيارة معبد امون (معبد الوحى) ,تجربة جديدة ,ابو شروف (استكشاف البحيرات ومناجم الملح). ,زيارة عين كليوباترا و امكانية النزول بها ,مشاهدة الدروب الجبلية  ,الخطرة و البحر الرمل العظيم. ,مشاهدة و امكانية السباحة في عيون الماء الطبيعية فى الصحراء. ,تسلق الكثبان الرملية ,استمتع بمشاهدة غروب الشمس من أحد التلال الرملية ,العشاء فى نور الوحة الفراخ بالزيتون الشهية ,الاستمتاع بالموسيقية السيوة الفريدة مع فرقة سيوية ,الاستمتاع بالشاى السيوى المميز بالاعشاب',
      'لافطار المبكر فى الفندق ,جولة حر للشوبينج فى السوق القديم لشراء المنتجات السيوة الفريدة ,(أختيارى ) رحلة ,سفارى الى بحر الرمال العظيم بعربيات السفارى 4x4 و هنزور عين المياة السخنة و البحيرة البارة فى وسط ,الصحراء , هنعمل ساند بوردينج , و نشرب شاى بدوى و نعمل كامب فير و حاجات تانية كتير  العشاء فراخ ابو مردم.',
      'الافطار المبكر فى الفندق ,تسليم الغرف ثم  رحلة العودة للديار .',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm5',
    categories: [
      'c2',
    ],
    title: 'بحيرة الريان',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://cnn-arabic-images.cnn.io/cloudinary/image/upload/w_1920,h_1080,c_fill,q_auto,g_center/cnnarabic/2019/07/08/images/130915.jpg',
    duration: 15,
    activities: [
      'زيارة قريه تونس ',
      ' شلالات وادي الريان',
      'زيادة بحيرة الريان ووادي الحيتان',
      'عمل سفاري في صحراء الفيوم',
      'زيارة جبل المدورة والبحيرة المسحورة'
    ],
    program: [
      'اليوم الاول : ( قرية تونس - شلالات زادي الريان - رحلة بحرية ) الوصول الي قرية تونس بالفيوم وتناول الافطار وبعدها زيارة مدرسة ايفيلين للخزف بالقرية ثم التحرك لزيارة مبنى معبد قصر قارون  ,زيارة شلالات وادي الريان ,لهواة التصوير يمكنهم التجول في منطقة الشلالات واخذ صور بجانب الشلالات وفي الماء والتمتع بالجو الجميل  ,التحرك لعمل رحله بالمركب داخل البحيرة ,لو مش عارف فنادق هناك بنقترح عليك بعد ما تلف جولتك دى تروح عصرا الى فندق نيو بانوراما البحيرة ودة فندق (3 نجوم) على ضفاف بحيرة قارون والتسكين بغرف زوجية وثلاثية (الغرف بتكون مطلة على الحديقة وليس البحيرة) تناول العشاء مساءا فى مطعم الفندق وترتاح وتستعد ليوم جديد.',
      '(زيارة منطقة قصور العرب - عمل سفاري في صحراء الفيوم - التوجه لوادي الحيتان - زيارة جبل المدورة والبحيرة المسحورة - الاربيان نايتس)  الاستيقاظ مبكرا الساعه 7 صباحا ,تناول الإفطار بمطعم الفندق  ,التحرك بسيارات الدفع الرباعى للاستعداد للمغامرة الشيقة فى صحراء الفيوم والبدء بمنطقة وادى الحيتان لمشاهدة الحفريات وأثار الحيتان ,دخول متحف وادي الحيتان ,التحرك إلي منطقة قصور العرب وممارسة الــ , sand-boarding  التحرك لزيارة البحيرة المسحورة وتناول وجبة الغداء  ,التحرك لزيارة جبل المدورة وصعود الجبل لمن يريد ومشاهدة اروع منظر من قمة الجبل  ,الاستعداد للمغادرة.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm6',
    categories: [
      'c2',
    ],
    title: 'بحيرة ناصر',
    tripType: TripType.Exploration,
    season: Season.Summer,
    imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSXAKPcLDykQVrdikJ01ngP9CabRRuVPDkvxg&usqp=CAU',
    duration: 240,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
    'خلال اليوم الأول، ستزور معبد كلابشة ومعبد بيت الوالي وكشك كيرتاسي. كما ستبحر إلى وادي السيبو بالقرب من مدار السرطان.',
    'عندما تغادر معبد واد السيبو ستكون في منتصف الرحلة في اليوم الثاني؛ والمكان التالي الذي ستزوره هو معبد دكة ومعبد المحرقة الذي يعود إلى العصر الإغريقي الروماني ,لكن الرحلة لا تنتهي هنا، فبعد ذلك ستبحر إلى معبد عمدا ومعبد الدر ومقبرة بنوت.',
    'في اليوم الثالث، ستزور في الصباح أبو سمبل لمشاهدة شروق الشمس على الواجهة الرائعة للمعبد، بالاضافة إلى زيارة ليلية أيضًا تمكنك من مشاهدة عرض بالصوت والضوء. تذكّر أن جميع الرحلات النهرية في النيل يجب حجزها مقدمًا. اذهب إلى أقرب مكتب جولات سياحية الآن.'
 ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm7',
    categories: [
      'c3',
    ],
    title: 'شاطئ الأول',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1493558103817-58b2924bce98?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTAxfHxiZWFjaHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 20,
    activities: [
      'التحرك إلى الشاطئ',
      'الإقامة على الشاطئ',
      'نزول البحر',
     'ركوب العاب الشاطئ',
      'الاستمتاع بالمناظر الطبيعية'
    ],
    program: [
      'تبدأ الرحلة إلى الشاطئ صباحاً ف الساعة التاسعة يبدأ التحرك من الفندق إلى الشاطئ ومن هناك يبدأ برنامج اليوم وليس شرطاً الالتزام بترتيب البرنامج ف بمجرد الوصول للشاطئ يمكنك نزول البحر والمشي على الشاطئ والجلوس أمام البحر والاستمتاع بالبرنامج كاملا',
     ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: false,
  ),
  Trip(
    id: 'm8',
    categories: [
      'c3',
    ],
    title: 'الشاطىء الكبير',
    tripType: TripType.Recovery,
    season: Season.Spring,
    imageUrl:
        'https://images.unsplash.com/photo-1519046904884-53103b34b206?ixid=MXwxMjA3fDB8MHxzZWFyY2h8Mnx8YmVhY2h8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 35,
    activities: [
      'زيارة الشاطئ',
    'ركوب المركب',
      'ألعاب الشاطئ',
      'الملاهي المائية'
    ],
    program: [
      'في اليوم الأول يتم التحرك من الفندق إلى الشاطئ تبدأ الرحلة والنزول للماء والسباحة',
      '.في اليوم التاني يكون البرنامج كله في الملاهي المائية وهي تتميز بألعاب كثيرة وحمامات السباحة',
      '.بينما اليوم الثالث والأخير يكون على الشاطئ وتكون ألعاب الشاطئ كالبراشوت والتزحلق على المياة',
      ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: false,
  ),
  Trip(
    id: 'm9',
    categories: [
      'c3',
    ],
    title: 'شاطىء الصخور',
    tripType: TripType.Exploration,
    season: Season.Summer,
    imageUrl:
        'https://images.unsplash.com/photo-1519602035691-16ac091344ef?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjE1fHxiZWFjaHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 45,
    activities: [
      'التجمع مع المجموعة ',
      'الذهاب للشاطئ',
      'اختيار موقع الإقامة',
      'مشاهدة معالم الشاطئ'
    ],
    program: [
      'يتم الذهاب للشاطئ نختار المكان المخصص للإقامة يتميز الشاطئ بالصخور التي تملأه عليك بالسباحة ف أي وقت ومشاهدة الصخور على الشاطئ والتمتع بالمناظر الخلابة للشاطئ والتمشية على الشاطئ وفي نهاية اليوم يتم العودة للفندق للاستعداد لليوم الثاني',
   'يبدأ بالذهاب للشاطئ للتجهيز للرحلة البحرية التي من خلالها يتم الذهاب في يخت ف البحر ويتم فيها الغوص لمشاهدة الصخور التي تغطيها المياه والاستمتاع بجمالها تحت الماء'
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: false,
  ),
  Trip(
    id: 'm10',
    categories: [
      'c4',
    ],
    title: 'الصحراء البيضاء',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTGgffuFiugPhGviPB-pFK9_-BBKn17MqXS5A&usqp=CAU',
    duration: 30,
    activities: [
      'الاستمتاع بجو الصحراء ',
      'الاستمتاع بالمناظر الخلابة والطعام البدوي',
      'زياره العديد من المناطق الطبيعية',
      'السباحه في الابار والعيون الخلابة',
     'زيارة المتاحف والكهوف'
    ],
    program: [
     'هتفطر وتنطلق بالعربية عشان تبدأ رحلتك داخل الصحراء البيضاء  ممكن تزور في اليوم الأول :منطقة الفلاسترون و زيارة العين الرومانية عين خضرا و  السنطه و زيارة الجبل المرصوص و قرية الحيز و منطقة العقبات وبليل هتبدا تنصب الخيام وتجهز عدة التخييم وتستمتع برصد التجمعات النجمية والابراج وتبدا سهره بدويه واللي هتشوي فيها علي ضوء النجوم وتعمل شاي بدوي ولا اروع من كده )',
      'الاستيقاظ مبكرا والإفطار والاستعداد لزيارة سنط شاهين , متحف المومياوات الذهبية, معبد الإسكندر الأكبر ,مشاهدة الواحات القديمة, زيارة وادي النخيل , البحيرة المالحة, زيارة منطقة الساند ديون ( كثبان رملية ), زيارة جبل الدست والمغرفة , مشاهدة الغروب من جبل الإنجليز , الوادي الغربي , كهف جاره ( ما بين كل الاماكن اللي هتزوروها كهف جاره هيكون اجملهم بسبب اشكال الصخور الرائعة الموجودة فيه)  وعلى اخر النهار ترجع الفندق عشان تاخد وجبة الغداء  و بليل هتختم باحلى حاجه وتزور عين كبريتية بتخرج مياه من تحت الارض بدرجة حرارة 40.درجه واللي بتساعد علي علاج بعض الأمراض الجلدية والاسترخاء متنساش تجيب معاك مايوه',
      '- هتصحي بدري تفطر وتتحرك لزيارة متحف بدر ( متحف لفنان تشكيلي اسمه بدر بينحت الصخور وبيرسم بالرمل لوحات تحفه اللوحات دي معروضة في اماكن كتير علي مستوي العالم بسبب جمالها ) هتخلص هناك وتطلع علي جبل الكريستال (عباره عن تجمعات كتير من الكريستال واللي بتعمل منظر رائع جدا واللي بيجي ليها الاجانب من كل مكان في العالم عشان يتفرجوا عليها )  هترجع الفندق وتعمل شيك اوت وترجع القاهره تعمل جوله حرة فى السوق لشراء الهدايا',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm11',
    categories: [
      'c4',
    ],
    title: 'الصحراء الغربية',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ95W5XrY6RAW9kuOpVCXiXnIpdG71cw_XVCQ&usqp=CAU',
    duration: 30,
    activities: [
      'الاستمتاع بالمناظر الطبيعية',
      'التخييم في الصحراء',
      'تناول الطعام علي الطريقه البدوية',
      ' مشاهدة الابار والعيون'

    ],
    program:[
      'الباص الساعه ١٢ صباحا وصلنا استراحه اسمها تويست الساعه ٥ صباحا عشان ناخد الفطار و من هناك اتحركنا بعربيات ٤*٤ مع دليل بدوي عشان ننطلق و نكتشف صحراء مصر,ميشينا وسط منطقه غرود ابو محرك و ديه منطقه الرمال بتاعتها ناعمه جدا و تعتبر انعم من الكثبان الرمليه عشان كده هتلاقي العربيات بتغرز كتير فعشان كده لازم يكون معاك دليل محترف عشان يعرف يتصرف في غرز العربيات عشان فعلا بتكون مرهقه جدا  ,خيمنا اول يوم في المنطقه ديه و هناك اتعلمنا ازاي ننصب الخيام و طبعا بيدوك سليبيج باج و بطانيه من الصوف عشان البرد الصحراوي بيكون صعب جدا ,هتلاقي المنطقه مميزه بصفاء السماء فهتكون النجوم واضحه جدا و هتستمتع بيها خصوصا لو ليك في النجوم و الفلك و المجره.',
      'تاني يوم اتحركنا علي عين خضرا عشان نحضر الغروب و ديه منطقه فيها اشجار نخيل و عين كبريتيه.',
      'تالت يوم اتحركنا علي كهف الجاره و ده عباره عن ترسبات حجريه ناتجه من المياه شبه مغاره جعيتا الي في لبنان بس علي اصغر و جوه الكهف ده هتنبهر بجماله مع اضاءه الشموع.',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm12',
    categories: [
      'c4',
    ],
    title: 'الصحراء الرملية',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1452022582947-b521d8779ab6?ixid=MXwxMjA3fDB8MHxzZWFyY2h8ODN8fGRlc2VydHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
       'الاستمتاع بالمناظر الطبيعية',
      'التخييم في الصحراء',
      'تناول الطعام علي الطريقه البدوية',
      ' مشاهدة الابار والعيون'

    ],
    program: [
       'هتفطر وتنطلق بالعربية عشان تبدأ رحلتك داخل الصحراء البيضاء  ممكن تزور في اليوم الأول :منطقة الفلاسترون و زيارة العين الرومانية عين خضرا و  السنطه و زيارة الجبل المرصوص و قرية الحيز و منطقة العقبات وبليل هتبدا تنصب الخيام وتجهز عدة التخييم وتستمتع برصد التجمعات النجمية والابراج وتبدا سهره بدويه واللي هتشوي فيها علي ضوء النجوم وتعمل شاي بدوي ولا اروع من كده )',
      'الاستيقاظ مبكرا والإفطار والاستعداد لزيارة سنط شاهين , متحف المومياوات الذهبية, معبد الإسكندر الأكبر ,مشاهدة الواحات القديمة, زيارة وادي النخيل , البحيرة المالحة, زيارة منطقة الساند ديون ( كثبان رملية ), زيارة جبل الدست والمغرفة , مشاهدة الغروب من جبل الإنجليز , الوادي الغربي , كهف جاره ( ما بين كل الاماكن اللي هتزوروها كهف جاره هيكون اجملهم بسبب اشكال الصخور الرائعة الموجودة فيه)  وعلى اخر النهار ترجع الفندق عشان تاخد وجبة الغداء  و بليل هتختم باحلى حاجه وتزور عين كبريتية بتخرج مياه من تحت الارض بدرجة حرارة 40.درجه واللي بتساعد علي علاج بعض الأمراض الجلدية والاسترخاء متنساش تجيب معاك مايوه',
      '- هتصحي بدري تفطر وتتحرك لزيارة متحف بدر ( متحف لفنان تشكيلي اسمه بدر بينحت الصخور وبيرسم بالرمل لوحات تحفه اللوحات دي معروضة في اماكن كتير علي مستوي العالم بسبب جمالها ) هتخلص هناك وتطلع علي جبل الكريستال (عباره عن تجمعات كتير من الكريستال واللي بتعمل منظر رائع جدا واللي بيجي ليها الاجانب من كل مكان في العالم عشان يتفرجوا عليها )  هترجع الفندق وتعمل شيك اوت وترجع القاهره تعمل جوله حرة فى السوق لشراء الهدايا',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm13',
    categories: [
      'c5',
    ],
    title: 'المدينة الأولى',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1498307833015-e7b400441eb8?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NDJ8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'الوصول الي الفندق و اخذ استراحة قصيرة ثم الذهاب لاخذ جولة سياحية في المدينة والعودة للفندق لتناول العشاء',
      'الاستيقاظ مبكرا لتناول الفطور و التحرك لزيارة المواقع الاثرية في المدينه ثم تناول الغداء ومشاهدة منظر الغروب',
      'الاستيقاظ وتناول الفطور في الخارج والقيام بجولة في المراكز التجارية وعمل تسوق ثم العودة للفندق',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm14',
    categories: [
      'c5',
    ],
    title: 'المدينة الثانية',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1467269204594-9661b134dd2b?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjR8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'الوصول الي الفندق و اخذ استراحة قصيرة ثم الذهاب لاخذ جولة سياحية في المدينة والعودة للفندق لتناول العشاء',
      'الاستيقاظ مبكرا لتناول الفطور و التحرك لزيارة المواقع الاثرية في المدينه ثم تناول الغداء ومشاهدة منظر الغروب',
      'الاستيقاظ وتناول الفطور في الخارج والقيام بجولة في المراكز التجارية وعمل تسوق ثم العودة للفندق',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm15',
    categories: [
      'c5',
    ],
    title: 'المدينة القديمة',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1519923041107-e4dc8d9193da?ixid=MXwxMjA3fDB8MHxzZWFyY2h8Njd8fG9sZCUyMGNpdHl8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'الوصول الي الفندق و اخذ استراحة قصيرة ثم الذهاب لاخذ جولة سياحية في المدينة والعودة للفندق لتناول العشاء',
      'الاستيقاظ مبكرا لتناول الفطور و التحرك لزيارة المواقع الاثرية في المدينه ثم تناول الغداء ومشاهدة منظر الغروب',
      'الاستيقاظ وتناول الفطور في الخارج والقيام بجولة في المراكز التجارية وعمل تسوق ثم العودة للفندق',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm16',
    categories: [
      'c6',
    ],
    title: 'رياضة التثلج',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1605540436563-5bca919ae766?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8c2tpaW5nfGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'التزحلق علي الجليد',
      'لبس ملابس الجليد ',
      'الاستمتاع بكثير من العاب الجليد',
      ' تناول الحلويات اللذيذة',
      'التقاط العديد من الصور الممتعه'
    ],
    program: [
      'تدخل تستلم الملابس المخصصة لمنطقة الثلج، وتكون عبارة عن suit وخوزة وجوانتي وشراب وحذاء و بمجرد ما أن ترتدي هذه الملابس تشعر بالثقل الشديد، وكأن بطريق تمشي في الثلج.بعدها تدخلوا جروب مع مدرب أو مدربة يعلم خطوة خطوة، وبعدها تبدأ في النزول من فوق لوحدك على الجليد بالمعدات بعد ما يعلموك، ولكن بالطبع ستأخذ وقعات جامدة ولكنها ف الوقت نفسه ممتعة ,بعدها تدخل البارك الكبيرة، وكلها ثلج وفيها ألعاب مميزة جدا، مثل الدوناتس وبتزحلق وفيه ball تداخل بداخلها وتدحرج إلى أن تنزل وممكن تقذفوا أصحابكم بالثلج.المكان مناسب للجميع سواء أصحاب أو عائلة وcouples، ولتفريغ الطاقة، وتكون هناك عروض للبطريق',
    ],
    isInSummer: false,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm17',
    categories: [
      'c6',
    ],
    title: 'القفز المظلي',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1601024445121-e5b82f020549?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTJ8fHBhcmFjaHV0ZSUyMGp1bXBpbmd8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'مشاهدة المدينه من الاعلي',
      'الاستمتاع بتجربة رايعه من المغامرة',
      'التزلج الهوائي',
      'استمتاع المناظر الجملية'
    ],
    program: [
    'رحلة الإبحار الشراعي في شرم الشيخ تمنحك رياضة التزلج الهوائي إمكانية الوصول إلى مناظر جوية لا تُنسى على شرم الشيخ وتوفر لك أروع تجربة طيران في الهواء مع مظلة مرفقة. إنه نشاط جذاب للغاية لأولئك المهتمين بالرياضات المتطرفة ، ولكنه جذاب بنفس القدر لأي شخص يرغب في القفز بالمظلات ولكن لا يريد القفز من طائرة. ستطير فوق شرم الشيخ لمدة 10 دقائق تقريبًا.'
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
];
